app/controllers/attendances_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def index
    @user = User.find(session[:user_id])

SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "attendances" WHERE (start > '2010-10-19 00:00:00' AND start < '2010-10-24 00:00:00' AND end IS NULL AND user_id = 1 )
---
  def show
    @user = User.find(params[:id])
    if !params[:date].nil?
      begin
        from = DateTime.new(y=params[:date]["from(1i)"].to_i, m=params[:date]["from(2i)"].to_i, d=params[:date]["from(3i)"].to_i, h=0, min=0, s=0)
        to = DateTime.new(y=params[:date]["to(1i)"].to_i, m=params[:date]["to(2i)"].to_i, d=params[:date]["to(3i)"].to_i, h=0, min=0, s=0)
      rescue
        from = Time.now
        to = Time.now
        flash[:notice] = "vybrane datum neni platne"
      end
      @attendances = Attendance.find(:all, :conditions => ["start > ? AND end < ?  AND user_id = ? ", from, to+1.day, @user.id])