app/controllers/manage_controller.rb

  def list_attendances
    @users = User.all
---
SELECT * FROM "users"