app/controllers/photos_controller.rb

  def take_pause_photo
    @photo = Photo.new
    @user = User.find(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def create_pause_photo
    @user = User.find(session[:user_id])
    @photo = Photo.new(params[:photo])
    @photo.image = File.new(upload_path)
    @photo.save
    if @user.attendances.last.pause_ended?
      @pause = Pause.create(:start => Time.now, :start_photo_id => @photo.id, :attendance_id => @user.attendances.last.id)
    else
      @pause = @user.attendances.last.pauses.last
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
INSERT INTO "photos" ("image_file_name", "created_at", "image_file_size", "updated_at", "image_content_type", "description", "image_updated_at") VALUES('4d62c62bf6906d16bb23a45046977e07.jpg', '2010-10-28 21:06:16', 303914, '2010-10-28 21:06:16', 'image/jpeg', NULL, '2010-10-28 21:06:16')
SELECT * FROM "attendances" WHERE ("attendances".user_id = 1) ORDER BY attendances.id DESC LIMIT 1
SELECT * FROM "pauses" WHERE ("pauses".attendance_id = 8) ORDER BY pauses.id DESC LIMIT 1
INSERT INTO "pauses" ("created_at", "updated_at", "end", "end_photo_id", "start", "start_photo_id", "attendance_id") VALUES('2010-10-28 21:06:35', '2010-10-28 21:06:35', NULL, NULL, '2010-10-28 21:06:35', 19, 8)
SELECT * FROM "pauses" WHERE ("pauses".attendance_id = 8)

  def take_attendance_photo
    @photo = Photo.new
    @user = User.find(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def create_attendance_photo
    @user = User.find(session[:user_id])
    @photo = Photo.new(params[:photo])
    @photo.image = File.new(upload_path)
    @photo.save
    if @user.attendance_ended?
      @attendance = Attendance.create(:start => Time.now, :start_photo_id => @photo.id, :user_id => @user.id)
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
INSERT INTO "photos" ("image_file_name", "created_at", "image_file_size", "updated_at", "image_content_type", "description", "image_updated_at") VALUES('5191ce78c8dd2e36d77086c655b0f146.jpg', '2010-10-15 07:32:09', 318904, '2010-10-15 07:32:09', 'image/jpeg', NULL, '2010-10-15 07:32:08')
INSERT INTO "attendances" ("created_at", "updated_at", "end", "end_photo_id", "start", "user_id", "start_photo_id") VALUES('2010-10-28 20:11:23', '2010-10-28 20:11:23', NULL, NULL, '2010-10-28 20:11:23', 1, 7)

  def show
    @photo = Photo.find(params[:id])
---
SELECT * FROM "photos" WHERE ("photos"."id" = 0)