app/controllers/users_controller.rb

SELECT * FROM "users"
---
  def list
    @users = User.all

SELECT * FROM "users" WHERE ("users"."card" = '1111') LIMIT 1
---
  def verify_user
    if params[:card].present? && @user = User.find_by_card(params[:card])

INSERT INTO "users" ("name", "created_at", "updated_at", "card", "phone", "photo_id", "surname", "email") VALUES('Jan', '2010-10-28 22:46:21', '2010-10-28 22:46:21', '1', '777111222', NULL, 'Žamboch', 'zambik@kdesi.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "phone" = '', "updated_at" = '2010-10-31 20:01:37', "email" = '', "name" = 'Jan', "surname" = 'Krica' WHERE "id" = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])